# Параметры окна графика
# В inches
WINDOW_WIDTH = 14
WINDOW_HEIGHT = 8

# Параметры фильтров
FILTER_START_LEFT = 0.02
FILTER_START_TOP = 0.8

ALL_LABEL = 'Все'

# Коды университетов и их расшифровки
UNIVERSITIES_CODES = {
    '02BD': 'ЧГУ'
}
UNIVERSITIES_DECODES = {
    'ЧГУ': '02BD'
}

# Коды факультетов университетов
FACULTIES_CODES = {
    '02BD': {
        '2': 'ПМФиИТ',
        '3': 'ХимФак',
        '4': 'Эконом',
        '7': 'МашФак',
        '8': 'СтройФак',
        '10': 'ИГФ',
        '12': 'ЮрФак',
        '14': 'ФИЯ',
        '15': 'МедФак',
        '16': 'РЭА',
        '17': 'ФУиСТ',
        '19': 'ИВТ',
        '20': 'Искусств',
        '21': 'Алатырь',
        '24': 'ЭЭ',
        '25': 'РиЧФиЖ',
        '30': 'НПК'
    }
}

FACULTIES_DECODES = {
    '02BD': {
        'ПМФиИТ': '2',
        'ХимФак': '3',
        'Эконом': '4',
        'МашФак': '7',
        'СтройФак': '8',
        'ИГФ': '10',
        'ЮрФак': '12',
        'ФИЯ': '14',
        'МедФак': '15',
        'РЭА': '16',
        'ФУиСТ': '17',
        'ИВТ': '19',
        'Искусств': '20',
        'Алатырь': '21',
        'ЭЭ': '24',
        'РиЧФиЖ': '25',
        'НПК': '30'
    }
}
